// Дано число, обозночающее день недели. Выяснить, является ли номер дня недели выходным?
Console.WriteLine("Введите число от 1 до 7:");
int N = int.Parse( Console.ReadLine() );
if (N == 1)
{
  Console.WriteLine("День недели НЕ ЯВЛЯЕТСЯ выходным");  
}
if (N == 2)
{
  Console.WriteLine("День недели НЕ ЯВЛЯЕТСЯ выходным");  
}
if (N == 3)
{
  Console.WriteLine("День недели НЕ ЯВЛЯЕТСЯ выходным");  
}
if (N == 4)
{
  Console.WriteLine("День недели НЕ ЯВЛЯЕТСЯ выходным");  
}
if (N == 5)
{
  Console.WriteLine("День недели НЕ ЯВЛЯЕТСЯ выходным");  
}
if (N == 6)
{
  Console.WriteLine("День недели ЯВЛЯЕТСЯ выходным");  
}
if (N == 7)
{
  Console.WriteLine("День недели ЯВЛЯЕТСЯ выходным");  
}